IDENTIFICATION DIVISION.
PROGRAM-ID. FIRSTCOBOL.
AUTHOR. HAPPY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME      PIC X(20).
01 WS-LASTNAME  PIC X(20).

PROCEDURE DIVISION.
    1000-START-PARA.
        DISPLAY "Enter your name : " WITH NO ADVANCING.
        ACCEPT WS-NAME.

        DISPLAY "Enter your lastname : " WITH NO ADVANCING.
        ACCEPT WS-LASTNAME.

        PERFORM 2000-DISPLAY-WELCOME.

        STOP RUN.

    2000-DISPLAY-WELCOME.
        DISPLAY "Welcome " WS-NAME " Your Last Name is " WS-LASTNAME.
